resource：

➜  terraform-provider-tencentcloud git:(master) ✗ make testacc TESTARGS="-run=TestAccTencentCloudRedisInstance"
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./... -v -run=TestAccTencentCloudRedisInstance -timeout 120m
?   	github.com/tencentcloudstack/terraform-provider-tencentcloud	[no test files]
testing: warning: no tests to run
PASS
ok  	github.com/tencentcloudstack/terraform-provider-tencentcloud/gendoc	0.747s [no tests to run]
=== RUN   TestAccTencentCloudRedisInstancesDataSource
--- PASS: TestAccTencentCloudRedisInstancesDataSource (45.46s)
=== RUN   TestAccTencentCloudRedisInstance
--- PASS: TestAccTencentCloudRedisInstance (120.34s)
PASS
ok  	github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud	166.485s
?   	github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud/connectivity	[no test files]
?   	github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud/internal/helper	[no test files]
?   	github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud/ratelimit	[no test files]


---------------


datasource：

➜  terraform-provider-tencentcloud git:(master) ✗ make testacc TESTARGS="-run=TestAccTencentCloudRedisInstancesDataSource"
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./... -v -run=TestAccTencentCloudRedisInstancesDataSource -timeout 120m
?   	github.com/tencentcloudstack/terraform-provider-tencentcloud	[no test files]
testing: warning: no tests to run
PASS
ok  	github.com/tencentcloudstack/terraform-provider-tencentcloud/gendoc	0.834s [no tests to run]
=== RUN   TestAccTencentCloudRedisInstancesDataSource
--- PASS: TestAccTencentCloudRedisInstancesDataSource (43.07s)
PASS
ok  	github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud	43.804s
?   	github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud/connectivity	[no test files]
?   	github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud/internal/helper	[no test files]
?   	github.com/tencentcloudstack/terraform-provider-tencentcloud/tencentcloud/ratelimit	[no test files]


----------------


➜  tmp tf apply
2020/11/09 21:52:48 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_redis_instance.redis_instance_test_2 will be created
  + resource "tencentcloud_redis_instance" "redis_instance_test_2" {
      + availability_zone  = "ap-shanghai-2"
      + charge_type        = "POSTPAID"
      + create_time        = (known after apply)
      + force_delete       = false
      + id                 = (known after apply)
      + ip                 = (known after apply)
      + mem_size           = 4096
      + name               = "terrform_test"
      + password           = (sensitive value)
      + port               = 6379
      + project_id         = 0
      + redis_replicas_num = 1
      + redis_shard_num    = 3
      + status             = (known after apply)
      + subnet_id          = (known after apply)
      + type_id            = 9
      + vpc_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  1 provider "tencentcloud" {
  Enter a value: yes

tencentcloud_redis_instance.redis_instance_test_2: Creating...
tencentcloud_redis_instance.redis_instance_test_2: Still creating... [10s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Still creating... [20s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Still creating... [30s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Still creating... [40s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Still creating... [50s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Still creating... [1m0s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Still creating... [1m10s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Still creating... [1m20s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Creation complete after 1m25s [id=crs-83b0i2qr]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
➜  tmp
➜  tmp
➜  tmp vim main.tf
➜  tmp
➜  tmp
➜  tmp
➜  tmp tf apply
2020/11/09 21:55:05 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_redis_instance.redis_instance_test_2: Refreshing state... [id=crs-83b0i2qr]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
➜  tmp
➜  tmp
➜  tmp vim terraform.tfstate
➜  tmp
➜  tmp
➜  tmp
➜  tmp
➜  tmp
➜  tmp
➜  tmp
➜  tmp vim main.tf
➜  tmp
➜  tmp tf apply
2020/11/09 21:56:46 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_redis_instance.redis_instance_test_2: Refreshing state... [id=crs-83b0i2qr]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # tencentcloud_redis_instance.redis_instance_test_2 will be updated in-place
  ~ resource "tencentcloud_redis_instance" "redis_instance_test_2" {
        availability_zone  = "ap-shanghai-2"
        charge_type        = "POSTPAID"
        create_time        = "2020-11-09 21:53:59"
        force_delete       = false
        id                 = "crs-83b0i2qr"
        ip                 = "10.66.160.78"
      ~ mem_size           = 4096 -> 8192
        name               = "terrform_test"
        password           = (sensitive value)
        port               = 6379
        project_id         = 0
        redis_replicas_num = 1
        redis_shard_num    = 3
        status             = "online"
        tags               = {}
        type_id            = 9
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_redis_instance.redis_instance_test_2: Modifying... [id=crs-83b0i2qr]
tencentcloud_redis_instance.redis_instance_test_2: Still modifying... [id=crs-83b0i2qr, 10s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Still modifying... [id=crs-83b0i2qr, 20s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Still modifying... [id=crs-83b0i2qr, 30s elapsed]
tencentcloud_redis_instance.redis_instance_test_2: Modifications complete after 31s [id=crs-83b0i2qr]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
➜  tmp
➜  tmp
➜  tmp
➜  tmp vim terraform.tfstate
➜  tmp
➜  tmp tf apply
2020/11/09 21:58:03 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_redis_instance.redis_instance_test_2: Refreshing state... [id=crs-83b0i2qr]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.


